export interface Thana {
  name: string
}

export interface District {
  name: string
  thanas: Thana[]
}

export interface Division {
  name: string
  districts: District[]
}

export const bangladeshDivisionsBn: Division[] = [
  {
    name: "ঢাকা",
    districts: [
      {
        name: "ঢাকা",
        thanas: [
          { name: "সাভার" },
          { name: "ধামরাই" },
          { name: "কেরানীগঞ্জ" },
          { name: "নবাবগঞ্জ" },
          { name: "দোহার" },
          { name: "গুলশান" },
          { name: "ধানমন্ডি" },
          { name: "মিরপুর" },
          { name: "পল্লবী" },
          { name: "ক্যান্টনমেন্ট" },
          { name: "রমনা" },
          { name: "মতিঝিল" },
          { name: "পল্টন" },
          { name: "লালবাগ" },
          { name: "হাজারীবাগ" },
          { name: "কোতোয়ালী" },
          { name: "সূত্রাপুর" },
          { name: "বংশাল" },
          { name: "ডেমরা" },
          { name: "শ্যামপুর" },
          { name: "বাড্ডা" },
          { name: "উত্তরা" },
          { name: "তুরাগ" },
          { name: "দক্ষিণখান" },
          { name: "খিলগাঁও" },
          { name: "কামরাঙ্গীরচর" },
          { name: "তেজগাঁও" },
          { name: "শেরেবাংলা নগর" },
          { name: "কাফরুল" },
          { name: "আদাবর" },
          { name: "মোহাম্মদপুর" },
          { name: "রামপুরা" },
          { name: "সবুজবাগ" },
          { name: "উত্তর খান" }
        ]
      },
      {
        name: "গাজীপুর",
        thanas: [
          { name: "গাজীপুর সদর" },
          { name: "কালিয়াকৈর" },
          { name: "কালীগঞ্জ" },
          { name: "কাপাসিয়া" },
          { name: "শ্রীপুর" },
          { name: "টঙ্গী" }
        ]
      },
      {
        name: "নারায়ণগঞ্জ",
        thanas: [
          { name: "নারায়ণগঞ্জ সদর" },
          { name: "আড়াইহাজার" },
          { name: "বন্দর" },
          { name: "রূপগঞ্জ" },
          { name: "সোনারগাঁও" },
          { name: "ফতুল্লা" },
          { name: "সিদ্ধিরগঞ্জ" }
        ]
      },
      {
        name: "টাঙ্গাইল",
        thanas: [
          { name: "টাঙ্গাইল সদর" },
          { name: "বাসাইল" },
          { name: "ভূঞাপুর" },
          { name: "দেলদুয়ার" },
          { name: "ঘাটাইল" },
          { name: "গোপালপুর" },
          { name: "কালিহাতী" },
          { name: "মধুপুর" },
          { name: "মির্জাপুর" },
          { name: "নাগরপুর" },
          { name: "সখিপুর" },
          { name: "ধনবাড়ী" }
        ]
      },
      {
        name: "কিশোরগঞ্জ",
        thanas: [
          { name: "কিশোরগঞ্জ সদর" },
          { name: "অষ্টগ্রাম" },
          { name: "বাজিতপুর" },
          { name: "ভৈরব" },
          { name: "হোসেনপুর" },
          { name: "ইটনা" },
          { name: "করিমগঞ্জ" },
          { name: "কটিয়াদী" },
          { name: "কুলিয়ারচর" },
          { name: "মিঠামইন" },
          { name: "নিকলী" },
          { name: "পাকুন্দিয়া" },
          { name: "তাড়াইল" }
        ]
      },
      {
        name: "মানিকগঞ্জ",
        thanas: [
          { name: "মানিকগঞ্জ সদর" },
          { name: "দৌলতপুর" },
          { name: "ঘিওর" },
          { name: "হরিরামপুর" },
          { name: "সাটুরিয়া" },
          { name: "শিবালয়" },
          { name: "সিঙ্গাইর" }
        ]
      },
      {
        name: "মুন্সীগঞ্জ",
        thanas: [
          { name: "মুন্সীগঞ্জ সদর" },
          { name: "গজারিয়া" },
          { name: "লৌহজং" },
          { name: "সিরাজদিখান" },
          { name: "শ্রীনগর" },
          { name: "টঙ্গীবাড়ী" }
        ]
      },
      {
        name: "নরসিংদী",
        thanas: [
          { name: "নরসিংদী সদর" },
          { name: "বেলাবো" },
          { name: "মনোহরদী" },
          { name: "পলাশ" },
          { name: "রায়পুরা" },
          { name: "শিবপুর" }
        ]
      },
      {
        name: "ফরিদপুর",
        thanas: [
          { name: "ফরিদপুর সদর" },
          { name: "আলফাডাঙ্গা" },
          { name: "ভাঙ্গা" },
          { name: "বোয়ালমারী" },
          { name: "চরভদ্রাসন" },
          { name: "মধুখালী" },
          { name: "নগরকান্দা" },
          { name: "সদরপুর" },
          { name: "সালথা" }
        ]
      },
      {
        name: "গোপালগঞ্জ",
        thanas: [
          { name: "গোপালগঞ্জ সদর" },
          { name: "কাশিয়ানী" },
          { name: "কোটালীপাড়া" },
          { name: "মুকসুদগঞ্জ" },
          { name: "টুঙ্গিপাড়া" }
        ]
      },
      {
        name: "মাদারীপুর",
        thanas: [
          { name: "মাদারীপুর সদর" },
          { name: "কালকিনি" },
          { name: "রাজৈর" },
          { name: "শিবচর" },
          { name: "দাসার" }
        ]
      },
      {
        name: "রাজবাড়ী",
        thanas: [
          { name: "রাজবাড়ী সদর" },
          { name: "বালিয়াকান্দি" },
          { name: "গোয়ালন্দ" },
          { name: "পাংশা" },
          { name: "কালুখালী" }
        ]
      },
      {
        name: "শরীয়তপুর",
        thanas: [
          { name: "শরীয়তপুর সদর" },
          { name: "ভেদরগঞ্জ" },
          { name: "ডামুড্যা" },
          { name: "গোসাইরহাট" },
          { name: "নড়িয়া" },
          { name: "জাজিরা" }
        ]
      }
    ]
  },
  {
    name: "চট্টগ্রাম",
    districts: [
      {
        name: "চট্টগ্রাম",
        thanas: [
          { name: "পটিয়া" },
          { name: "হাটহাজারী" },
          { name: "সন্দ্বীপ" },
          { name: "ফটিকছড়ি" },
          { name: "রাঙ্গুনিয়া" },
          { name: "রাউজান" },
          { name: "মিরসরাই" },
          { name: "সীতাকুণ্ড" },
          { name: "বোয়ালখালী" },
          { name: "আনোয়ারা" },
          { name: "চন্দনাইশ" },
          { name: "লোহাগাড়া" },
          { name: "বাঁশখালী" },
          { name: "সাতকানিয়া" },
          { name: "কর্ণফুলী" }
        ]
      },
      {
        name: "কক্সবাজার",
        thanas: [
          { name: "কক্সবাজার সদর" },
          { name: "চকরিয়া" },
          { name: "মহেশখালী" },
          { name: "রামু" },
          { name: "টেকনাফ" },
          { name: "উখিয়া" },
          { name: "পেকুয়া" },
          { name: "কুতুবদিয়া" }
        ]
      },
      {
        name: "কুমিল্লা",
        thanas: [
          { name: "কুমিল্লা সদর" },
          { name: "বরুড়া" },
          { name: "ব্রাহ্মণপাড়া" },
          { name: "বুড়িচং" },
          { name: "চান্দিনা" },
          { name: "চৌদ্দগ্রাম" },
          { name: "দাউদকান্দি" },
          { name: "দেবীদ্বার" },
          { name: "হোমনা" },
          { name: "লাকসাম" },
          { name: "মুরাদনগর" },
          { name: "নাঙ্গলকোট" },
          { name: "তিতাস" },
          { name: "মনোহরগঞ্জ" },
          { name: "মেঘনা" }
        ]
      },
      {
        name: "ব্রাহ্মণবাড়িয়া",
        thanas: [
          { name: "ব্রাহ্মণবাড়িয়া সদর" },
          { name: "আখাউড়া" },
          { name: "আশুগঞ্জ" },
          { name: "বাঞ্ছারামপুর" },
          { name: "বিজয়নগর" },
          { name: "কসবা" },
          { name: "নবীনগর" },
          { name: "নাসিরনগর" },
          { name: "সরাইল" }
        ]
      },
      {
        name: "ফেনী",
        thanas: [
          { name: "ফেনী সদর" },
          { name: "ছাগলনাইয়া" },
          { name: "দাগনভূঞা" },
          { name: "পরশুরাম" },
          { name: "সোনাগাজী" },
          { name: "ফুলগাজী" }
        ]
      },
      {
        name: "চাঁদপুর",
        thanas: [
          { name: "চাঁদপুর সদর" },
          { name: "ফরিদগঞ্জ" },
          { name: "হাইমচর" },
          { name: "হাজীগঞ্জ" },
          { name: "কচুয়া" },
          { name: "মতলব উত্তর" },
          { name: "মতলব দক্ষিণ" },
          { name: "শাহরাস্তি" }
        ]
      },
      {
        name: "লক্ষ্মীপুর",
        thanas: [
          { name: "লক্ষ্মীপুর সদর" },
          { name: "রায়পুর" },
          { name: "রামগঞ্জ" },
          { name: "রামগতি" },
          { name: "কমলনগর" }
        ]
      },
      {
        name: "নোয়াখালী",
        thanas: [
          { name: "নোয়াখালী সদর" },
          { name: "বেগমগঞ্জ" },
          { name: "চাটখিল" },
          { name: "কোম্পানীগঞ্জ" },
          { name: "হাতিয়া" },
          { name: "সেনবাগ" },
          { name: "সোনাইমুড়ী" },
          { name: "সুবর্ণচর" },
          { name: "কবিরহাট" }
        ]
      },
      {
        name: "বান্দরবান",
        thanas: [
          { name: "বান্দরবান সদর" },
          { name: "আলীকদম" },
          { name: "লামা" },
          { name: "নাইক্ষ্যংছড়ি" },
          { name: "রোয়াংছড়ি" },
          { name: "রুমা" },
          { name: "থানচি" }
        ]
      },
      {
        name: "খাগড়াছড়ি",
        thanas: [
          { name: "খাগড়াছড়ি সদর" },
          { name: "দীঘিনালা" },
          { name: "লক্ষ্মীছড়ি" },
          { name: "মহালছড়ি" },
          { name: "মানিকছড়ি" },
          { name: "মাটিরাঙ্গা" },
          { name: "পানছড়ি" },
          { name: "রামগড়" },
          { name: "গুইমারা" }
        ]
      },
      {
        name: "রাঙ্গামাটি",
        thanas: [
          { name: "রাঙ্গামাটি সদর" },
          { name: "বাঘাইছড়ি" },
          { name: "বরকল" },
          { name: "বেলাইছড়ি" },
          { name: "জুরাছড়ি" },
          { name: "কাপ্তাই" },
          { name: "কাউখালী" },
          { name: "লংগদু" },
          { name: "নানিয়ারচর" },
          { name: "রাজস্থলী" }
        ]
      }
    ]
  },
  {
    name: "রাজশাহী",
    districts: [
      {
        name: "রাজশাহী",
        thanas: [
          { name: "পবা" },
          { name: "বাগমারা" },
          { name: "বাঘা" },
          { name: "চারঘাট" },
          { name: "দুর্গাপুর" },
          { name: "গোদাগাড়ী" },
          { name: "মোহনপুর" },
          { name: "পুঠিয়া" },
          { name: "তানোর" }
        ]
      },
      {
        name: "বগুড়া",
        thanas: [
          { name: "বগুড়া সদর" },
          { name: "আদমদীঘি" },
          { name: "ধুনট" },
          { name: "ধুপচাঁচিয়া" },
          { name: "গাবতলী" },
          { name: "কাহালু" },
          { name: "নন্দীগ্রাম" },
          { name: "সারিয়াকান্দি" },
          { name: "শাজাহানপুর" },
          { name: "শেরপুর" },
          { name: "শিবগঞ্জ" },
          { name: "সোনাতলা" }
        ]
      },
      {
        name: "পাবনা",
        thanas: [
          { name: "পাবনা সদর" },
          { name: "আটঘরিয়া" },
          { name: "বেড়া" },
          { name: "ভাঙ্গুড়া" },
          { name: "চাটমোহর" },
          { name: "ফরিদপুর" },
          { name: "ঈশ্বরদী" },
          { name: "সাঁথিয়া" },
          { name: "সুজানগর" }
        ]
      },
      {
        name: "সিরাজগঞ্জ",
        thanas: [
          { name: "সিরাজগঞ্জ সদর" },
          { name: "বেলকুচি" },
          { name: "চৌহালী" },
          { name: "কামারখন্দ" },
          { name: "কাজীপুর" },
          { name: "রায়গঞ্জ" },
          { name: "শাহজাদপুর" },
          { name: "তাড়াশ" },
          { name: "উল্লাপাড়া" }
        ]
      },
      {
        name: "নওগাঁ",
        thanas: [
          { name: "নওগাঁ সদর" },
          { name: "আত্রাই" },
          { name: "বদলগাছী" },
          { name: "ধামোইরহাট" },
          { name: "মান্দা" },
          { name: "মহাদেবপুর" },
          { name: "নিয়ামতপুর" },
          { name: "পত্নীতলা" },
          { name: "পোরশা" },
          { name: "রাণীনগর" },
          { name: "সাপাহার" }
        ]
      },
      {
        name: "নাটোর",
        thanas: [
          { name: "নাটোর সদর" },
          { name: "বাগাতিপাড়া" },
          { name: "বড়াইগ্রাম" },
          { name: "গুরুদাসপুর" },
          { name: "লালপুর" },
          { name: "সিংড়া" },
          { name: "নলডাঙ্গা" }
        ]
      },
      {
        name: "চাঁপাইনবাবগঞ্জ",
        thanas: [
          { name: "সদর" },
          { name: "ভোলাহাট" },
          { name: "গোমস্তাপুর" },
          { name: "নাচোল" },
          { name: "শিবগঞ্জ" }
        ]
      },
      {
        name: "জয়পুরহাট",
        thanas: [
          { name: "জয়পুরহাট সদর" },
          { name: "আক্কেলপুর" },
          { name: "কালাই" },
          { name: "খেতলাল" },
          { name: "পাঁচবিবি" }
        ]
      }
    ]
  },
  {
    name: "খুলনা",
    districts: [
      {
        name: "খুলনা",
        thanas: [
          { name: "খুলনা সদর" },
          { name: "বটিয়াঘাটা" },
          { name: "ডুমুরিয়া" },
          { name: "দিঘলিয়া" },
          { name: "দাকোপ" },
          { name: "কয়রা" },
          { name: "পাইকগাছা" },
          { name: "ফুলতলা" },
          { name: "রূপসা" },
          { name: "তেরখাদা" }
        ]
      },
      {
        name: "যশোর",
        thanas: [
          { name: "যশোর সদর" },
          { name: "অভয়নগর" },
          { name: "বাঘারপাড়া" },
          { name: "চৌগাছা" },
          { name: "ঝিকরগাছা" },
          { name: "কেশবপুর" },
          { name: "মণিরামপুর" },
          { name: "শার্শা" }
        ]
      },
      {
        name: "বাগেরহাট",
        thanas: [
          { name: "বাগেরহাট সদর" },
          { name: "চিতলমারী" },
          { name: "ফকিরহাট" },
          { name: "কচুয়া" },
          { name: "মোল্লাহাট" },
          { name: "মোংলা" },
          { name: "মোড়েলগঞ্জ" },
          { name: "রামপাল" },
          { name: "শরণখোলা" }
        ]
      },
      {
        name: "কুষ্টিয়া",
        thanas: [
          { name: "কুষ্টিয়া সদর" },
          { name: "ভেড়ামারা" },
          { name: "দৌলতপুর" },
          { name: "খোকসা" },
          { name: "কুমারখালী" },
          { name: "মিরপুর" }
        ]
      },
      {
        name: "সাতক্ষীরা",
        thanas: [
          { name: "সাতক্ষীরা সদর" },
          { name: "আশাশুনি" },
          { name: "দেবহাটা" },
          { name: "কলারোয়া" },
          { name: "কালীগঞ্জ" },
          { name: "শ্যামনগর" },
          { name: "তালা" }
        ]
      },
      {
        name: "ঝিনাইদহ",
        thanas: [
          { name: "ঝিনাইদহ সদর" },
          { name: "হরিণাকুণ্ডু" },
          { name: "কালীগঞ্জ" },
          { name: "কোটচাঁদপুর" },
          { name: "মহেশপুর" },
          { name: "শৈলকুপা" }
        ]
      },
      {
        name: "চুয়াডাঙ্গা",
        thanas: [
          { name: "চুয়াডাঙ্গা সদর" },
          { name: "আলমডাঙ্গা" },
          { name: "দামুড়হুদা" },
          { name: "জীবননগর" }
        ]
      },
      {
        name: "মাগুরা",
        thanas: [
          { name: "মাগুরা সদর" },
          { name: "মোহাম্মদপুর" },
          { name: "শালিখা" },
          { name: "শ্রীপুর" }
        ]
      },
      {
        name: "মেহেরপুর",
        thanas: [
          { name: "মেহেরপুর সদর" },
          { name: "গাংনী" },
          { name: "মুজিবনগর" }
        ]
      },
      {
        name: "নড়াইল",
        thanas: [
          { name: "নড়াইল সদর" },
          { name: "কালিয়া" },
          { name: "লোহাগড়া" }
        ]
      }
    ]
  },
  {
    name: "বরিশাল",
    districts: [
      {
        name: "বরিশাল",
        thanas: [
          { name: "বরিশাল সদর" },
          { name: "আগৈলঝাড়া" },
          { name: "বাবুগঞ্জ" },
          { name: "বাকেরগঞ্জ" },
          { name: "বানারীপাড়া" },
          { name: "গৌরনদী" },
          { name: "হিজলা" },
          { name: "মেহেন্দিগঞ্জ" },
          { name: "মুলাদী" },
          { name: "উজিরপুর" }
        ]
      },
      {
        name: "ভোলা",
        thanas: [
          { name: "ভোলা সদর" },
          { name: "বোরহানউদ্দিন" },
          { name: "চরফ্যাশন" },
          { name: "দৌলতখান" },
          { name: "লালমোহন" },
          { name: "মনপুরা" },
          { name: "তজুমদ্দিন" }
        ]
      },
      {
        name: "পটুয়াখালী",
        thanas: [
          { name: "পটুয়াখালী সদর" },
          { name: "বাউফল" },
          { name: "দশমিনা" },
          { name: "গলাচিপা" },
          { name: "কলাপাড়া" },
          { name: "মির্জাগঞ্জ" },
          { name: "রাঙ্গাবালী" },
          { name: "দুমকি" }
        ]
      },
      {
        name: "পিরোজপুর",
        thanas: [
          { name: "পিরোজপুর সদর" },
          { name: "ভান্ডারিয়া" },
          { name: "কাউখালী" },
          { name: "মঠবাড়িয়া" },
          { name: "নাজিরপুর" },
          { name: "নেছারাবাদ" },
          { name: "ইন্দুরকানী" }
        ]
      },
      {
        name: "বরগুনা",
        thanas: [
          { name: "বরগুনা সদর" },
          { name: "আমতলী" },
          { name: "বামনা" },
          { name: "বেতাগী" },
          { name: "পাথরঘাটা" },
          { name: "তালতলী" }
        ]
      },
      {
        name: "ঝালকাঠি",
        thanas: [
          { name: "ঝালকাঠি সদর" },
          { name: "কাঁঠালিয়া" },
          { name: "নলছিটি" },
          { name: "রাজাপুর" }
        ]
      }
    ]
  },
  {
    name: "সিলেট",
    districts: [
      {
        name: "সিলেট",
        thanas: [
          { name: "সিলেট সদর" },
          { name: "বালাগঞ্জ" },
          { name: "বিয়ানীবাজার" },
          { name: "বিশ্বনাথ" },
          { name: "কোম্পানীগঞ্জ" },
          { name: "ফেঞ্চুগঞ্জ" },
          { name: "গোলাপগঞ্জ" },
          { name: "গোয়াইনঘাট" },
          { name: "জৈন্তাপুর" },
          { name: "কানাইঘাট" },
          { name: "জকিগঞ্জ" },
          { name: "দক্ষিণ সুরমা" },
          { name: "ওসমানীনগর" }
        ]
      },
      {
        name: "হবিগঞ্জ",
        thanas: [
          { name: "হবিগঞ্জ সদর" },
          { name: "আজমিরীগঞ্জ" },
          { name: "বাহুবল" },
          { name: "বানিয়াচং" },
          { name: "চুনারুঘাট" },
          { name: "লাখাই" },
          { name: "মাধবপুর" },
          { name: "নবীগঞ্জ" },
          { name: "শায়েস্তাগঞ্জ" }
        ]
      },
      {
        name: "মৌলভীবাজার",
        thanas: [
          { name: "মৌলভীবাজার সদর" },
          { name: "বড়লেখা" },
          { name: "কমলগঞ্জ" },
          { name: "কুলাউড়া" },
          { name: "রাজনগর" },
          { name: "শ্রীমঙ্গল" },
          { name: "জুড়ী" }
        ]
      },
      {
        name: "সুনামগঞ্জ",
        thanas: [
          { name: "সুনামগঞ্জ সদর" },
          { name: "বিশ্বম্ভরপুর" },
          { name: "ছাতক" },
          { name: "দেরাই" },
          { name: "ধরমপাশা" },
          { name: "দোয়ারাবাজার" },
          { name: "জগন্নাথপুর" },
          { name: "জামালগঞ্জ" },
          { name: "শাল্লা" },
          { name: "তাহিরপুর" },
          { name: "দিরাই" }
        ]
      }
    ]
  },
  {
    name: "রংপুর",
    districts: [
      {
        name: "রংপুর",
        thanas: [
          { name: "রংপুর সদর" },
          { name: "বদরগঞ্জ" },
          { name: "গংগাচড়া" },
          { name: "কাউনিয়া" },
          { name: "মিঠাপুকুর" },
          { name: "পীরগাছা" },
          { name: "পীরগঞ্জ" },
          { name: "তারাগঞ্জ" }
        ]
      },
      {
        name: "দিনাজপুর",
        thanas: [
          { name: "দিনাজপুর সদর" },
          { name: "বিরামপুর" },
          { name: "বীরগঞ্জ" },
          { name: "বিরল" },
          { name: "বোচাগঞ্জ" },
          { name: "চিরিরবন্দর" },
          { name: "ঘোড়াঘাট" },
          { name: "হাকিমপুর" },
          { name: "কাহারোল" },
          { name: "খানসামা" },
          { name: "নবাবগঞ্জ" },
          { name: "পার্বতীপুর" },
          { name: "ফুলবাড়ী" }
        ]
      },
      {
        name: "গাইবান্ধা",
        thanas: [
          { name: "গাইবান্ধা সদর" },
          { name: "ফুলছড়ি" },
          { name: "গোবিন্দগঞ্জ" },
          { name: "পলাশবাড়ী" },
          { name: "সাদুল্লাপুর" },
          { name: "সাঘাটা" },
          { name: "সুন্দরগঞ্জ" }
        ]
      },
      {
        name: "কুড়িগ্রাম",
        thanas: [
          { name: "কুড়িগ্রাম সদর" },
          { name: "ভুরুঙ্গামারী" },
          { name: "চর রাজীবপুর" },
          { name: "চিলমারী" },
          { name: "ফুলবাড়ী" },
          { name: "নাগেশ্বরী" },
          { name: "রাজারহাট" },
          { name: "রৌমারী" },
          { name: "উলিপুর" }
        ]
      },
      {
        name: "নিলফামারী",
        thanas: [
          { name: "নিলফামারী সদর" },
          { name: "ডিমলা" },
          { name: "ডোমার" },
          { name: "জলঢাকা" },
          { name: "কিশোরগঞ্জ" },
          { name: "সৈয়দপুর" }
        ]
      },
      {
        name: "পঞ্চগড়",
        thanas: [
          { name: "পঞ্চগড় সদর" },
          { name: "আটোয়ারী" },
          { name: "বোদা" },
          { name: "দেবীগঞ্জ" },
          { name: "তেঁতুলিয়া" }
        ]
      },
      {
        name: "ঠাকুরগাঁও",
        thanas: [
          { name: "ঠাকুরগাঁও সদর" },
          { name: "বালিয়াডাঙ্গী" },
          { name: "হরিপুর" },
          { name: "পীরগঞ্জ" },
          { name: "রাণীশংকৈল" }
        ]
      },
      {
        name: "লালমনিরহাট",
        thanas: [
          { name: "লালমনিরহাট সদর" },
          { name: "আদিতমারী" },
          { name: "হাতিবান্ধা" },
          { name: "কালীগঞ্জ" },
          { name: "পাটগ্রাম" }
        ]
      }
    ]
  },
  {
    name: "ময়মনসিংহ",
    districts: [
      {
        name: "ময়মনসিংহ",
        thanas: [
          { name: "ময়মনসিংহ সদর" },
          { name: "ভালুকা" },
          { name: "ধোবাউড়া" },
          { name: "ফুলবাড়িয়া" },
          { name: "গফরগাঁও" },
          { name: "গৌরীপুর" },
          { name: "হালুয়াঘাট" },
          { name: "ঈশ্বরগঞ্জ" },
          { name: "মুক্তাগাছা" },
          { name: "নান্দাইল" },
          { name: "ফুলপুর" },
          { name: "ত্রিশাল" },
          { name: "তারাকান্দা" }
        ]
      },
      {
        name: "জামালপুর",
        thanas: [
          { name: "জামালপুর সদর" },
          { name: "বকশীগঞ্জ" },
          { name: "দেওয়ানগঞ্জ" },
          { name: "ইসলামপুর" },
          { name: "মাদারগঞ্জ" },
          { name: "মেলান্দহ" },
          { name: "সরিষাবাড়ী" }
        ]
      },
      {
        name: "নেত্রকোণা",
        thanas: [
          { name: "নেত্রকোণা সদর" },
          { name: "আটপাড়া" },
          { name: "বারহাট্টা" },
          { name: "দুর্গাপুর" },
          { name: "খালিয়াজুরী" },
          { name: "কলমাকান্দা" },
          { name: "কেন্দুয়া" },
          { name: "মদন" },
          { name: "মোহনগঞ্জ" },
          { name: "পূর্বধলা" }
        ]
      },
      {
        name: "শেরপুর",
        thanas: [
          { name: "শেরপুর সদর" },
          { name: "ঝিনাইগাতী" },
          { name: "নকলা" },
          { name: "নালিতাবাড়ী" },
          { name: "শ্রীবরদী" }
        ]
      }
    ]
  }
]
